cf_billing/Catalogs/энргВидыБлагоустройств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргВидыБлагоустройств</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Благоустройства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Благоустройство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестБлагоустройства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыСтроений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипСтроения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргТипыСтроений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргВидыБлагоустройств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Получение_Данных

Функция ПолучитьБлагоустроваПоВидуБлагоустройств(ВидыБлагоустройств = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВидыБлагоустройств.Ссылка КАК ВидБлагоустройства,
		|	энргВидыБлагоустройствБлагоустройства.Благоустройство КАК Благоустройство
		|ИЗ
		|	Справочник.энргВидыБлагоустройств КАК энргВидыБлагоустройств
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыБлагоустройств.Благоустройства КАК энргВидыБлагоустройствБлагоустройства
		|		ПО энргВидыБлагоустройств.Ссылка = энргВидыБлагоустройствБлагоустройства.Ссылка
		|			И (НЕ энргВидыБлагоустройств.ПометкаУдаления)
		|			И (энргВидыБлагоустройств.Ссылка В (&ВидыБлагоустройств))
		|ИТОГИ ПО
		|	ВидБлагоустройства";
	Если ВидыБлагоустройств = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (энргВидыБлагоустройств.Ссылка В (&ВидыБлагоустройств))", "");
	Иначе 
		Запрос.УстановитьПараметр("ВидыБлагоустройств", ВидыБлагоустройств);
	КонецЕсли;
	
	РезультатЗапроса 	= Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти

#Область Проверка_Данных

Процедура ПроверитьСоответствияБлагоустройств(Отказ, Благоустройства, ВидыБлагоустройств) Экспорт 
	
	РезультатЗапроса 				= ПолучитьБлагоустроваПоВидуБлагоустройств(ВидыБлагоустройств); 	
	Выборка 						= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КоличествоБлагоустройствОтбор 	= Благоустройства.Количество();
	Пока Выборка.Следующий() Цикл
	
		ДетальныеЗаписи 		= Выборка.Выбрать();		
		МассивБлагоустройств 	= СформироватьМассивДляСверки(ДетальныеЗаписи);
		
		Если НЕ ВидБлагоустройстваСоответствуетСпискуБлагоустройств(КоличествоБлагоустройствОтбор, Благоустройства, МассивБлагоустройств) Тогда			
			Отказ = Истина;
			Прервать;
		КонецЕсли;  		
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедуры

Процедура ВывестиБлагоустройства(Форма, ТЧВидовБлагоустройства, ТЧБлагоустройств, ПолеДляВыгрузки) Экспорт
	
	КоллекцияВидовБлагоустройства 	= Форма.Объект[ТЧВидовБлагоустройства];
	Запрос 							= Новый Запрос; 	
	Запрос.Текст 					= 
	"ВЫБРАТЬ
	|	ДанныеТабЧасти." + ПолеДляВыгрузки + " КАК ВидБлагоустройства
	|ПОМЕСТИТЬ ДанныеТабЧасти
	|ИЗ
	|	&ДанныеТабЧасти КАК ДанныеТабЧасти
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргВидыБлагоустройствБлагоустройства.Благоустройство КАК Благоустройство
	|ИЗ
	|	ДанныеТабЧасти КАК ДанныеТабЧасти
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыБлагоустройств.Благоустройства КАК энргВидыБлагоустройствБлагоустройства
	|		ПО ДанныеТабЧасти.ВидБлагоустройства = энргВидыБлагоустройствБлагоустройства.Ссылка";
	
	Запрос.УстановитьПараметр("ДанныеТабЧасти", КоллекцияВидовБлагоустройства.Выгрузить(,ПолеДляВыгрузки));	
	
	Результат  				= Запрос.Выполнить();
	Выборка 				= Результат.Выбрать();
	
	КоллекцияБлагоустройств = Форма[ТЧБлагоустройств];
	КоллекцияБлагоустройств.Очистить();
	Пока Выборка.Следующий() Цикл
		СтрокаДляЗаполнения = КоллекцияБлагоустройств.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДляЗаполнения, Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВидыБлагоустройств(Форма, МассивИмяТаблицыБлагоустройств, ИмяТаблицыВидовБлагоустройств) Экспорт 
	
	КоллекцияВидовБлагоустройств 	= Форма[ИмяТаблицыВидовБлагоустройств];	
	КоллекцияВидовБлагоустройств.Очистить();
		
	Для Каждого ИмяТаблицыБлагоустройств Из МассивИмяТаблицыБлагоустройств Цикл 
		КоллекцияБлагоустройств 		= Форма[ИмяТаблицыБлагоустройств];
		МассивБлагоустройствИзОбъекта 	= новый Массив;
		Для Каждого ТекБлаго из КоллекцияБлагоустройств Цикл
			МассивБлагоустройствИзОбъекта.Добавить(ТекБлаго.Благоустройство);
		КонецЦикла;
		
		КоличествоБлагоустройств 		= МассивБлагоустройствИзОбъекта.Количество();	
		
		РезультатЗапроса 				= ПолучитьБлагоустроваПоВидуБлагоустройств(); 	
		Выборка 						= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			
			ДетальныеЗаписи 		= Выборка.Выбрать();
			МассивБлагоустройств 	= СформироватьМассивДляСверки(ДетальныеЗаписи);
			
			Если ВидБлагоустройстваСоответствуетСпискуБлагоустройств(КоличествоБлагоустройств, МассивБлагоустройствИзОбъекта, МассивБлагоустройств) Тогда
				СтрокаДляЗаполнения = КоллекцияВидовБлагоустройств.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДляЗаполнения, Выборка);
			КонецЕсли;  		
			
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

Функция ВидБлагоустройстваСоответствуетСпискуБлагоустройств(КоличествоБлагоустройствОтбор, МассивБлагоустройствИзОбъекта, МассивБлагоустройствВыборка) Экспорт 
	Возврат КоличествоБлагоустройствОтбор = МассивБлагоустройствВыборка.Количество() и ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(МассивБлагоустройствИзОбъекта, МассивБлагоустройствВыборка);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Функция СформироватьМассивДляСверки(ДетальныеЗаписи)
	МассивБлагоустройств	= Новый Массив;
	
	Пока ДетальныеЗаписи.Следующий() Цикл
		МассивБлагоустройств.Добавить(ДетальныеЗаписи.Благоустройство);
	КонецЦикла;
	
	Возврат МассивБлагоустройств;
КонецФункции

#КонецОбласти

#КонецЕсли
